08-ajax/food_trucking/app/views/dishes/index.html.erb

SELECT COUNT(*) FROM "likes" WHERE "likes"."dish_id" = $1  [["dish_id", 1]]
---
    <footer class="content">
      <span class="pull-right likes-count"><%= dish.likes.count %></span>

SELECT "dishes".* FROM "dishes"
---
<script>
  $('.star').on('click', function(event) {

    var dish_id = $(event.target).closest('.ui-card').data('dish-id')
    $.ajax({
        url: '/api/likes',
        method: 'post',
        data: { dish_id: dish_id }
        }).done(
          function(resp) {
          var $likesCount = $(event.target).closest('.ui-card').find('.likes-count');
          $likesCount.text(resp.likes_count);
          console.log(  $likesCount.text() )
          });
    })