08-ajax/food_trucking/app/controllers/api/comments_controller.rb

INSERT INTO "comments" ("body", "dish_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", ""], ["dish_id", 1], ["created_at", "2017-10-18 00:40:20.505773"], ["updated_at", "2017-10-18 00:40:20.505773"]]
---
  def create
    sleep 4
    comment = Comment.new
    comment.dish_id = params[:dish_id]
    comment.body = params[:body]
    if comment.save