08-ajax/food_trucking/app/controllers/dishes_controller.rb

  def show
    @dish = Dish.find(params[:id])
---
SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    dish = Dish.new
    dish.image = params[:dish][:image]
    dish.save
---
INSERT INTO "dishes" ("created_at", "updated_at", "image") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2017-10-23 01:19:32.495223"], ["updated_at", "2017-10-23 01:19:32.495223"], ["image", "orange.jpg"]]